{
  "recipes": [
    {
      "title": "Lemon Rice",
      "imageURL": "https://www.indianveggiedelight.com/wp-content/uploads/2023/03/lemon-rice-stovetop-featured.jpg",
      "cookTime": "40",
      "instructions": "Heat a pan,add 3 tablespoon coconut oil when it became hot make the flame into low than add 1 teaspoon mustard seeds to splutter.\nafter we can add 1 teaspoon urad dal,chana dal along with sliced red dried red chillies and saute it for 1/2 minutes.After\nit we can add the cashew nuts or peanuts and saute it for a minute.Next we can add the curry leaves and saute everything\nwell.After we can add turmeric powder and saute it for 1 minutes.Next we can add asafoetida powder and mix all well.\nYou can add salt according to Your taste and mix it Next We can add cooked rice and mix it gently.After it we can add\n1/4 cup lemon juice and mix everything gently.Cook it for 2-3 minutes and again mix it gently then off the flame\nand we can serve the rice.",
      "id": 8
    },
    {
      "title": "Fresh Strawberry Cake With Strawberry Sauce",
      "imageURL": "https://img-food.boxspace.in/image/rbk_5c3c20fd54116/xhdpi.jpg",
      "cookTime": "50",
      "instructions": "In a large mixing bowl, using an electric hand mixer, beat egg with sugar on high speed for 5 minutes or until light in color and thick.\nAdd sour cream, oil, vanilla and beat on low speed until well combined.\nIn a small bowl, whisk together: flour, baking powder, baking soda and salt until well incorporated. mix the dry ingredients into the wet ingredients in small batches and mix with the help of spatula.\nPour half of the batter into greased cake mould. Top with choppes strawberries then spread remaining batter over the top. Cover the surface with 6 halved strawberries, cut-side-down, pressing them down just slightly into the batter.\nBake at 180 degrees in a preheated oven for 45-50 minutes, or until a toothpick inserted into center comes out clean without wet cake batter.\nWhile the cake is baking, make the strawberry sauce: In a blender or food processor, combine chopped strawberries and sugar and blend until pureed.\nlet the cake come to room temperature before de-moulding. To serve, dust with powdered sugar if desired and drizzle individual slices generously with strawberry syrup.",
      "id": 10
    },
    {
      "title": "Chettinad Chicken",
      "imageURL": "https://www.funfoodfrolic.com/wp-content/uploads/2020/11/Chicken-Chettinad-Thumbnail.jpg",
      "cookTime": "45",
      "instructions": "Take a pan and roast Cumin,poppy seeds,fennel seeds,dry red chillies,cinnamon,cardamom,cloves and coconut\nThen grind it to fine powder.\nHeat oil in pan and add curry leaves.add the sliced onions and fry till they are light brown then add the crushed garlic and ginger\nAdd the ground spices and star anise and fry for a minute\nadd the tomatoes, turmeric, salt and stir in the chilli powder.\nAdd the chicken, cover and leave to simmer on the lowest setting until it is tender about 25 minutes.\nOnce chicken is cooked squeeze lime and remove from heat\nGarnish with coriander leaves.",
      "id": 11
    },
    {
      "title": "Chicken Biryani",
      "imageURL": "https://norecipes.com/wp-content/uploads/2017/05/chicken-biryani-006.jpg",
      "cookTime": "60",
      "instructions": "Take a pot put 3 tbsp oil which you fried birista with, keep on flame and add whole garam masala let it splutter\nAdd tomatoes and cook on med flame till its soft and paste formed\nAdd all spices, ginger garlic and dahi mix well add potatoes and cook on low or med flame...\nAdd meat, birista (remuv little, 1 tbsp of birista for rice) n tomato puree (n kip high flame if its watery)\nWhen dried up a bit simmer if u are not mixing with rice\nIf mixing with rice do not simmer kip aside will simmer with rice....\nRice: keep a pot on flame with 6 cups of water, add whole garam masala and let boil when bubbling add salt, rice and jeera cook till almost done....\nKeep ready a strainer beneath a pot, pour all rice with water on it n let all water get strained out....\nIn de same pot wich u boiled rice put half of the rice put 2 tbsp ghee and 2 tbsp used oil of birista if remaining, mix well\nAdd saffron with lemon juice mix well with rice, one each side of rice put little color n spread de color so rice is coloured in different colors...\nIn Meat masala pot pour rice add ghee 1 tbsp n stir slightly n spread rice evenly\nSprinkle remaining birista then spread coloured rice and little oil\nTake baking paper or foil paper cut size of pot, and keep on the rice then put a lid\nKeep the entire pot to simmer keep sumthing heavy on top so no smoke escapes...\nIf using charcoal can keep few charcoal on top and leave very few in the charcoal stove...\nAfter 20mins you will get nice aroma of rice, check if smoke comes out as u open its done, if nt done keep more....\nDo jhhak/smoke, make a bowl of foil paper and put 1 tsp ghee in it\nDo jhhak/smoke, make a bowl of foil paper and put 1 tsp ghee in it\nAfter 15 mins remove, separate rice from masala and serve\nServe wid raita or kachoomer.....\nNB: if keeping rice and meat separate then simmer separately when both done...",
      "id": 13
    }
  ],
  "categories": []
}